tap "romkatv/powerlevel10k"
# Search tool like grep, but optimized for programmers
brew "ack"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Bit is a modern Git CLI
brew "bit-git"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# CLI program that accepts piped input and presents files for selection
brew "fpp"
# Command-line fuzzy finder written in Go
brew "fzf"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open-source GitLab command-line tool
brew "glab"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Use Neovim as pager
brew "page"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Theme for zsh
brew "powerlevel10k"
# File browser
brew "ranger"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Multi-platform code-search similar to ack and ag
brew "the_platinum_searcher"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Plugin manager for tmux
brew "tpm"
# Maintained ctags implementation
brew "universal-ctags"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "zsh"
# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"
# Auto-close and delete matching delimiters in zsh
brew "zsh-autopair"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Feature-rich syntax highlighting for Zsh
brew "zsh-fast-syntax-highlighting"
# Better and friendly vi(vim) mode plugin for ZSH
brew "zsh-vi-mode"
# Minimal installer for conda specific to conda-forge
cask "miniforge"
# Scientific and technical publishing system built on Pandoc
cask "quarto"
