tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "ack"
brew "bash"
brew "bat"
brew "bat-extras"
brew "bit-git"
brew "bitwarden-cli"
brew "black"
brew "bottom"
brew "cairo"
brew "coreutils"
brew "diff-so-fancy"
brew "duti"
brew "dvc"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "fpp"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-tar"
brew "gnupg"
brew "imagemagick"
brew "jq"
brew "librsvg"
brew "luarocks"
brew "moreutils"
brew "neovim"
brew "neovide"
brew "node"
brew "noti"
brew "page"
brew "pandoc"
brew "pass"
brew "python@3.11"
brew "ranger"
brew "reattach-to-user-namespace"
brew "rename"
brew "ripgrep"
brew "ripgrep-all"
brew "ruby"
brew "rust"
brew "rustup-init"
brew "sc-im"
brew "shellcheck"
brew "tccutil"
brew "the_platinum_searcher"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tmux"
brew "tpm"
brew "universal-ctags"
brew "vim"
brew "weasyprint"
brew "wget"
brew "xpdf"
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-completions"
brew "zsh-vi-mode"
brew "zsh-you-should-use"
brew "powerlevel10k"
cask "mambaforge"
cask "font-fira-code-nerd-font"
cask "font-fontawesome"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"
vscode "asvetliakov.vscode-neovim"
vscode "eamodio.gitlens"
vscode "jonsmithers.open-in-vim"
vscode "ms-python.black-formatter"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "quarto.quarto"
vscode "REditorSupport.r"
vscode "TabNine.tabnine-vscode"
vscode "WallabyJs.quokka-vscode"
